{
  "class_name": "Functional",
  "config": {
    "name": "functional",
    "trainable": true,
    "layers": [
      {
        "class_name": "InputLayer",
        "config": {
          "dtype": "float32",
          "sparse": false,
          "ragged": false,
          "name": "input_layer",
          "batch_input_shape": [
            null,
            23,
            4
          ]
        },
        "name": "input_layer",
        "inbound_nodes": []
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d",
          "trainable": true,
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1d",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    23,
                    4
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "input_layer",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "class_name": "MaxPooling1D",
        "config": {
          "name": "max_pooling1d",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2
          ],
          "padding": "valid",
          "strides": [
            2
          ],
          "data_format": "channels_last"
        },
        "name": "max_pooling1d",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    21,
                    64
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "conv1d",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "class_name": "Conv1D",
        "config": {
          "name": "conv1d_1",
          "trainable": true,
          "dtype": "float32",
          "filters": 128,
          "kernel_size": [
            3
          ],
          "strides": [
            1
          ],
          "padding": "valid",
          "data_format": "channels_last",
          "dilation_rate": [
            1
          ],
          "groups": 1,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "conv1d_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    10,
                    64
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "max_pooling1d",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "class_name": "Attention",
        "config": {
          "name": "attention",
          "trainable": true,
          "dtype": "float32",
          "use_scale": false,
          "score_mode": "dot",
          "dropout": 0.0
        },
        "name": "attention",
        "inbound_nodes": [
          {
            "args": [
              [
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      8,
                      128
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "conv1d_1",
                      0,
                      0
                    ]
                  }
                },
                {
                  "class_name": "__keras_tensor__",
                  "config": {
                    "shape": [
                      null,
                      8,
                      128
                    ],
                    "dtype": "float32",
                    "keras_history": [
                      "conv1d_1",
                      0,
                      0
                    ]
                  }
                }
              ]
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "class_name": "Flatten",
        "config": {
          "name": "flatten",
          "trainable": true,
          "dtype": "float32",
          "data_format": "channels_last"
        },
        "name": "flatten",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    8,
                    128
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "attention",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense",
          "trainable": true,
          "dtype": "float32",
          "units": 256,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    1024
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "flatten",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.3,
          "seed": null,
          "noise_shape": null
        },
        "name": "dropout",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    256
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dense",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {
              "training": false
            }
          }
        ]
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "module": "keras.initializers",
            "class_name": "GlorotUniform",
            "config": {
              "seed": null
            },
            "registered_name": null
          },
          "bias_initializer": {
            "module": "keras.initializers",
            "class_name": "Zeros",
            "config": {},
            "registered_name": null
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        },
        "name": "dense_1",
        "inbound_nodes": [
          {
            "args": [
              {
                "class_name": "__keras_tensor__",
                "config": {
                  "shape": [
                    null,
                    256
                  ],
                  "dtype": "float32",
                  "keras_history": [
                    "dropout",
                    0,
                    0
                  ]
                }
              }
            ],
            "kwargs": {}
          }
        ]
      }
    ],
    "input_layers": [
      "input_layer",
      0,
      0
    ],
    "output_layers": [
      "dense_1",
      0,
      0
    ]
  }
}